Repository: darviarush/perl-aion-fs
Catalog: i18n/Aion/Fs.*.po
Languages: ru_en

source: Aion::Fs - утилиты для файловой системы: чтение, запись, поиск, замена файлов и т.д.
ru_en: Aion::Fs - utilities for the file system: reading, writing, searching, replacing files, etc.

source: Этот модуль облегчает использование файловой системы.
ru_en: This module makes it easier to use the file system.

source: Модули `File::Path`, `File::Slurper` и `File::Find` обременены различными возможностями, которые используются редко, но требуют времени на ознакомление и тем самым повышают порог входа.
ru_en: Modules `File::Path`, `File::Slurper` and `File::Find` is burdened with various features that are rarely used, but require time to become familiar with and thereby increase the barrier to entry.

source: В `Aion::Fs` же использован принцип программирования KISS - чем проще, тем лучше!
ru_en: `Aion::Fs` uses the KISS programming principle - the simpler the better!

source: Супермодуль `IO::All` не является конкурентом `Aion::Fs`, т.к. использует ООП подход, а `Aion::Fs` – ФП.
ru_en: The `IO::All` supermodule is not a competitor to `Aion::Fs`, because uses an OOP approach, and `Aion::Fs` is FP.

source: * ООП — объектно-ориентированное программирование. * ФП — функциональное программирование.
ru_en: * OOP - object-oriented programming. * FP - functional programming.

source: Считывает файл. Если параметр не указан, использует `$_`.
ru_en: Reads the file. If no parameter is specified, use `$_`.

source: `cat` читает со слоем `:utf8`. Но можно указать другой слой следующим образом:
ru_en: `cat` reads with layer `:utf8`. But you can specify another layer like this:

source: `cat` вызывает исключение в случае ошибки операции ввода-вывода:
ru_en: `cat` throws an exception if the I/O operation fails:

source: Записывает `$content` в `$file`.
ru_en: Writes `$content` to `$file`.

source: * Если указан один параметр, использует `$_` вместо `$file`. * `lay`, использует слой `:utf8`. Для указания иного слоя используется массив из двух элементов в параметре `$file`:
ru_en: * If one parameter is specified, use `$_` instead of `$file`. * `lay`, uses the `:utf8` layer. To specify a different layer, use an array of two elements in the `$file` parameter:

source: Рекурсивно обходит и возвращает пути из указанного пути или путей, если `$path` является ссылкой на массив. Без параметров использует `$_` как `$path`.
ru_en: Recursively traverses and returns paths from the specified path or paths if `$path` is an array reference. Without parameters, uses `$_` as `$path`.

source: Фильтры могут быть:
ru_en: Filters can be:

source: * Подпрограммой — путь к текущему файлу передаётся в `$_`, а подпрограмма должна вернуть истину или ложь, как они понимаются perl-ом. * Regexp — тестирует каждый путь регулярным выражением. * Строка в виде "-Xxx", где `Xxx` — один или несколько символов. Аналогична операторам perl-а для тестирования файлов. Пример: `-fr` проверяет путь файловыми тестировщиками [-f и -r](https://perldoc.perl.org/functions/-X). * Остальные строки превращаются функцией `wildcard` (см. ниже) в регулярное выражение для проверки каждого пути.
ru_en: * By subroutine - the path to the current file is passed to `$_`, and the subroutine must return true or false, as understood by Perl. * Regexp - tests each path with a regular expression. * String in the form "-Xxx", where `Xxx` is one or more characters. Similar to Perl operators for testing files. Example: `-fr` checks the path with file testers [-f and -r](https://perldoc.perl.org/functions/-X). * The remaining lines are turned by the `wildcard` function (see below) into a regular expression to test each path.

source: Пути, не прошедшие проверку `@filters`, не возвращаются.
ru_en: Paths that fail the `@filters` check are not returned.

source: Если фильтр -X не является файловой функцией perl, то выбрасывается исключение:
ru_en: If the -X filter is not a perl file function, an exception is thrown:

source: В этом примере `find` не может войти в подкаталог и передаёт ошибку в функцию `errorenter` (см. ниже) с установленными переменными `$_` и `$!` (путём к каталогу и сообщением ОС об ошибке).
ru_en: In this example, `find` cannot enter the subdirectory and passes an error to the `errorenter` function (see below) with the `$_` and `$!` variables set (to the directory path and the OS error message).

source: **Внимание!** Если `errorenter` не указана, то все ошибки **игнорируются**!
ru_en: **Attention!** If `errorenter` is not specified, then all errors are **ignored**!

source: * <AudioFile::Find> — ищет аудиофайлы в указанной директории. Позволяет фильтровать их по атрибутам: названию, артисту, жанру, альбому и трэку. * <Directory::Iterator> — `$it = Directory::Iterator->new($dir, %opts); push @paths, $_ while <$it>`. * <IO::All> — `@paths = map { "$_" } grep { -f $_ && $_->size > 10*1024 } io(".")->all(0)`. * <IO::All::Rule> — `$next = IO::All::Rule->new->file->size(">10k")->iter($dir1, $dir2); push @paths, "$f" while $f = $next->()`. * <File::Find> — `find( sub { push @paths, $File::Find::name if /\.png/ }, $dir )`. * <File::Find::utf8> — как <File::Find>, только пути файлов в _utf8_. * <File::Find::Age> — сортирует файлы по времени модификации (наследует <File::Find::Rule>): `File::Find::Age->in($dir1, $dir2)`. * <File::Find::Declare> — `@paths = File::Find::Declare->new({ size => '>10K', perms => 'wr-wr-wr-', modified => '<2010-01-30', recurse => 1, dirs => [$dir1] })->find`. * <File::Find::Iterator> — имеет ООП интерфейс с итератором и функции `imap` и `igrep`. * <File::Find::Match> — вызывает обработчик на каждый подошедший фильтр. Похож на `switch`. * <File::Find::Node> — обходит иерархию файлов параллельно несколькими процессами: `tie @paths, IPC::Shareable, { key => "GLUE STRING", create => 1 }; File::Find::Node->new(".")->process(sub { my $f = shift; $f->fork(5); tied(@paths)->lock; push @paths, $f->path; tied(@paths)->unlock })->find; tied(@paths)->remove`. * <File::Find::Fast> — `@paths = @{ find($dir) }`. * <File::Find::Object> — имеет ООП интерфейс с итератором. * <File::Find::Parallel> — умеет сравнивать два каталога и возвращать их объединение, пересечение и количественное пересечение. * <File::Find::Random> — выбирает файл или директорию наугад из иерархии файлов. * <File::Find::Rex> — `@paths = File::Find::Rex->new(recursive => 1, ignore_hidden => 1)->query($dir, qr/^b/i)`. * <File::Find::Rule> — `@files = File::Find::Rule->any( File::Find::Rule->file->name('*.mp3', '*.ogg')->size('>2M'), File::Find::Rule->empty )->in($dir1, $dir2);`. Имеет итератор, процедурный интерфейс и расширения [::ImageSize](File::Find::Rule::ImageSize) и [::MMagic](File::Find::Rule::MMagic): `@images = find(file => magic => 'image/*', '!image_x' => '>20', in => '.')`. * <File::Find::Wanted> — `@paths = find_wanted( sub { -f && /\.png/ }, $dir )`. * <File::Hotfolder> — `watch( $dir, callback => sub { push @paths, shift } )->loop`. Работает на `AnyEvent`. Настраиваемый. Есть распараллеливание на несколько процессов. * <File::Mirror> — формирует так же параллельный путь для копирования файлов: `recursive { my ($src, $dst) = @_; push @paths, $src } '/path/A', '/path/B'`. * <File::Set> — `$fs = File::Set->new; $fs->add($dir); @paths = map { $_->[0] } $fs->get_path_list`. * <File::Wildcard> — `$fw = File::Wildcard->new(exclude => qr/.svn/, case_insensitive => 1, sort => 1, path => "src///*.cpp", match => qr(^src/(.*?)\.cpp$), derive => ['src/$1.o','src/$1.hpp']); push @paths, $f while $f = $fw->next`. * <File::Wildcard::Find> — `findbegin($dir); push @paths, $f while $f = findnext()` или `findbegin($dir); @paths = findall()`. * <File::Util> — `File::Util->new->list_dir($dir, qw/ --pattern=\.txt$ --files-only --recurse /)`. * <Path::Find> — `@paths = path_find( $dir, "*.png" )`. Для сложных запросов использует _matchable_: `my $sub = matchable( sub { my( $entry, $directory, $fullname, $depth ) = @_; $depth <= 3 }`. * <Path::Extended::Dir> — `@paths = Path::Extended::Dir->new($dir)->find('*.txt')`. * <Path::Iterator::Rule> — `$i = Path::Iterator::Rule->new->file; @paths = $i->clone->size(">10k")->all(@dirs); $i->size("<10k")...`. * <Path::Class::Each> — `dir($dir)->each(sub { push @paths, "$_" })`. * <Path::Class::Iterator> — `$i = Path::Class::Iterator->new(root => $dir, depth => 2); until ($i->done) { push @paths, $i->next->stringify }`. * <Path::Class::Rule> — `@paths = Path::Class::Rule->new->file->size(">10k")->all($dir)`.
ru_en: * <AudioFile::Find> - searches for audio files in the specified directory. Allows you to filter them by attributes: title, artist, genre, album and track. * <Directory::Iterator> - `$it = Directory::Iterator->new($dir, %opts); push @paths, $_ while <$it>`. * <IO::All> - `@paths = map { "$_" } grep { -f $_ && $_->size > 10*1024 } io(".")->all(0)`. * <IO::All::Rule> - `$next = IO::All::Rule->new->file->size(">10k")->iter($dir1, $dir2); push @paths, "$f" while $f = $next->()`. * <File::Find> - `find( sub { push @paths, $File::Find::name if /\.png/ }, $dir )`. * <File::Find::utf8> - like <File::Find>, only file paths are in _utf8_. * <File::Find::Age> - sorts files by modification time (inherits <File::Find::Rule>): `File::Find::Age->in($dir1, $dir2)`. * <File::Find::Declare> — `@paths = File::Find::Declare->new({ size => '>10K', perms => 'wr-wr-wr-', modified => '<2010-01-30', recurse => 1, dirs => [$dir1] })->find`. * <File::Find::Iterator> - has an OOP interface with an iterator and the `imap` and `igrep` functions. * <File::Find::Match> - calls a handler for each matching filter. Similar to `switch`. * <File::Find::Node> - traverses the file hierarchy in parallel by several processes: `tie @paths, IPC::Shareable, { key => "GLUE STRING", create => 1 }; File::Find::Node->new(".")->process(sub { my $f = shift; $f->fork(5); tied(@paths)->lock; push @paths, $ f->path; tied(@paths)->unlock })->find; tied(@paths)->remove`. * <File::Find::Fast> - `@paths = @{ find($dir) }`. * <File::Find::Object> - has an OOP interface with an iterator. * <File::Find::Parallel> - can compare two directories and return their union, intersection and quantitative intersection. * <File::Find::Random> - selects a file or directory at random from the file hierarchy. * <File::Find::Rex> - `@paths = File::Find::Rex->new(recursive => 1, ignore_hidden => 1)->query($dir, qr/^b/i) `. * <File::Find::Rule> — `@files = File::Find::Rule->any( File::Find::Rule->file->name('*.mp3', '*.ogg ')->size('>2M'), File::Find::Rule->empty )->in($dir1, $dir2);`. Has an iterator, procedural interface, and [::ImageSize](File::Find::Rule::ImageSize) and [::MMagic](File::Find::Rule::MMagic) extensions: `@images = find(file => magic => 'image/*', '!image_x' => '>20', in => '.')`. * <File::Find::Wanted> - `@paths = find_wanted( sub { -f && /\.png/ }, $dir )`. * <File::Hotfolder> - `watch( $dir, callback => sub { push @paths, shift } )->loop`. Powered by `AnyEvent`. Customizable. There is parallelization into several processes. * <File::Mirror> - also forms a parallel path for copying files: `recursive { my ($src, $dst) = @_; push @paths, $src } '/path/A', '/path/B'`. * <File::Set> - `$fs = File::Set->new; $fs->add($dir); @paths = map { $_->[0] } $fs->get_path_list`. * <File::Wildcard> — `$fw = File::Wildcard->new(exclude => qr/.svn/, case_insensitive => 1, sort => 1, path => "src///*.cpp ", match => qr(^src/(.*?)\.cpp$), derive => ['src/$1.o','src/$1.hpp']); push @paths, $f while $f = $fw->next`. * <File::Wildcard::Find> - `findbegin($dir); push @paths, $f while $f = findnext()` or `findbegin($dir); @paths = findall()`. * <File::Util> - `File::Util->new->list_dir($dir, qw/ --pattern=\.txt$ --files-only --recurse /)`. * <Path::Find> - `@paths = path_find( $dir, "*.png" )`. For complex queries, use _matchable_: `my $sub = matchable( sub { my( $entry, $directory, $fullname, $depth ) = @_; $depth <= 3 }`. * <Path::Extended::Dir> - `@paths = Path::Extended::Dir->new($dir)->find('*.txt')`. * <Path::Iterator::Rule> - `$i = Path::Iterator::Rule->new->file; @paths = $i->clone->size(">10k")->all(@dirs); $i->size("<10k")...`. * <Path::Class::Each> - `dir($dir)->each(sub { push @paths, "$_" })`. * <Path::Class::Iterator> - `$i = Path::Class::Iterator->new(root => $dir, depth => 2); until ($i->done) { push @paths, $i->next->stringify }`. * <Path::Class::Rule> - `@paths = Path::Class::Rule->new->file->size(">10k")->all($dir)`.

source: Говорит `find` не входить в каталоги соответствующие фильтрам за ним.
ru_en: Tells `find` not to enter directories matching the filters behind it.

source: Вызывает `&block` для каждой ошибки возникающей при невозможности войти в какой-либо каталог.
ru_en: Calls `&block` for every error that occurs when a directory cannot be entered.

source: Останавливает `find` будучи вызван в одном из его фильтров, `errorenter` или `noenter`.
ru_en: Stops `find` being called in one of its filters, `errorenter` or `noenter`.

source: Удаляет файлы и пустые каталоги. Возвращает `@paths`. При ошибке ввода-вывода выбрасывает исключение.
ru_en: Removes files and empty directories. Returns `@paths`. If there is an I/O error, it throws an exception.

source: * <unlink> + <rmdir>. * <File::Path> — `remove_tree("dir")`. * <File::Path::Tiny> — `File::Path::Tiny::rm($path)`. Не выбрасывает исключений.
ru_en: * <unlink> + <rmdir>. * <File::Path> - `remove_tree("dir")`. * <File::Path::Tiny> - `File::Path::Tiny::rm($path)`. Does not throw exceptions.

source: Заменяет каждый файл на `$_`, если его изменяет `&sub`. Возвращает файлы, в которых не было замен.
ru_en: Replaces each file with `$_` if it is modified by `&sub`. Returns files that have no replacements.

source: `@files` может содержать массивы из двух элементов. Первый рассматривается как путь, а второй — как слой. Слой по умолчанию — `:utf8`.
ru_en: `@files` can contain arrays of two elements. The first is treated as a path and the second as a layer. The default layer is `:utf8`.

source: `&sub` вызывается для каждого файла из `@files`. В неё передаются:
ru_en: `&sub` is called for each file in `@files`. It transmits:

source: * `$_` — содержимое файла. * `$a` — путь к файлу. * `$b` — слой которым был считан файл и которым он будет записан.
ru_en: * `$_` - file contents. * `$a` — path to the file. * `$b` — the layer by which the file was read and by which it will be written.

source: В примере ниже файл "replace.ex" считывается слоем `:utf8`, а записывается слоем `:raw` в функции `replace`:
ru_en: In the example below, the file "replace.ex" is read by the `:utf8` layer and written by the `:raw` layer in the `replace` function:

source: Как **mkdir -p**, но считает последнюю часть пути (после последней косой черты) именем файла и не создаёт её каталогом. Без параметра использует `$_`.
ru_en: Like **mkdir -p**, but considers the last part of the path (after the last slash) to be a filename and does not create it as a directory. Without a parameter, uses `$_`.

source: * Если `$path` не указан, использует `$_`. * Если `$path` является ссылкой на массив, тогда используется путь в качестве первого элемента и права в качестве второго элемента. * Права по умолчанию — `0755`. * Возвращает `$path`.
ru_en: * If `$path` is not specified, use `$_`. * If `$path` is an array reference, then the path is used as the first element and rights as the second element. * The default permission is `0755`. * Returns `$path`.

source: * <File::Path> — `mkpath("dir1/dir2")`. * <File::Path::Tiny> — `File::Path::Tiny::mk($path)`. Не выбрасывает исключений.
ru_en: * <File::Path> - `mkpath("dir1/dir2")`. * <File::Path::Tiny> - `File::Path::Tiny::mk($path)`. Does not throw exceptions.

source: Время модификации `$path` в unixtime с дробной частью (из `Time::HiRes::stat`). Без параметра использует `$_`.
ru_en: Modification time of `$path` in unixtime with fractional part (from `Time::HiRes::stat`). Without a parameter, uses `$_`.

source: * `-M` — `-M "file.txt"`, `-M _` в днях от текущего времени. * <stat> — `(stat "file.txt")[9]` в секундах (unixtime). * <Time::HiRes> — `(Time::HiRes::stat "file.txt")[9]` в секундах с дробной частью.
ru_en: * `-M` — `-M "file.txt"`, `-M _` in days from the current time. * <stat> - `(stat "file.txt")[9]` in seconds (unixtime). * <Time::HiRes> - `(Time::HiRes::stat "file.txt")[9]` in seconds with fractional part.

source: Возвращает статистику о файле. Без параметра использует `$_`.
ru_en: Returns statistics about the file. Without a parameter, uses `$_`.

source: Чтобы можно было использовать с другими файловыми функциями, может получать ссылку на массив из которого берёт первый элемент в качестве файлового пути.
ru_en: To be used with other file functions, it can receive a reference to an array from which it takes the first element as the file path.

source: Выбрасывает исключение, если файл не существует или нет прав:
ru_en: Throws an exception if the file does not exist or does not have permission:

source: * <Fcntl> – содержит константы для распознавания режима. * <BSD::stat> – дополнительно возвращает atime, ctime и mtime в наносекундах, флаги пользователя и номер генерации файла. Имеет ООП-интерфейс. * <File::chmod> – `chmod("o=,g-w","file1","file2")`, `@newmodes = getchmod("+x","file1","file2")`. * <File::stat> – предоставляет ООП-интерфейс к stat. * <File::Stat::Bits> – аналогичен <Fcntl>. * <File::stat::Extra> – расширяет <File::stat> методами для получения информации о режиме, а так же перезагружает **-X**, **<=>**, **cmp** и **~~** операторы и стрингифицируется. * <File::Stat::Ls> – возвращает режим в формате утилиты ls. * <File::Stat::Moose> – ООП интерфейс на Moose. * <File::Stat::OO> – предоставляет ООП-интерфейс к stat. Может возвращать atime, ctime и mtime сразу в `DateTime`. * <File::Stat::Trigger> – следилка за изменением атрибутов файла. * <Linux::stat> – парсит /proc/stat и возвращает доп-информацию. Однако в других ОС не работает. * <Stat::lsMode> – возвращает режим в формате утилиты ls. * <VMS::Stat> – возвращает списки VMS ACL.
ru_en: * <Fcntl> – contains constants for mode recognition. * <BSD::stat> - optionally returns atime, ctime and mtime in nanoseconds, user flags and file generation number. Has an OOP interface. * <File::chmod> – `chmod("o=,g-w","file1","file2")`, `@newmodes = getchmod("+x","file1","file2")`. * <File::stat> – provides an OOP interface to stat. * <File::Stat::Bits> – similar to <Fcntl>. * <File::stat::Extra> – extends <File::stat> with methods to obtain information about the mode, and also reloads **-X**, **<=>**, **cmp** and **~~** operators and stringified. * <File::Stat::Ls> – returns the mode in the format of the ls utility. * <File::Stat::Moose> – OOP interface for Moose. * <File::Stat::OO> – provides an OOP interface to stat. Can return atime, ctime and mtime at once in `DateTime`. * <File::Stat::Trigger> – monitors changes in file attributes. * <Linux::stat> – parses /proc/stat and returns additional information. However, it does not work on other OSes. * <Stat::lsMode> – returns the mode in the format of the ls utility. * <VMS::Stat> – returns VMS ACLs.

source: Разбивает файловый путь на составляющие или собирает его из составляющих.
ru_en: Splits a file path into its components or assembles it from its components.

source: * Если получает ссылку на массив, то воспринимает его первый элемент как путь. * Если получает ссылку на хэш, то собирает из него путь. Незнакомые ключи просто игнорирует. Так же игнорирует volume в UNIX. * К файловой системе не обращается.
ru_en: * If it receives a reference to an array, it treats its first element as a path. * If it receives a link to a hash, it collects a path from it. Unfamiliar keys are simply ignored. Also ignores volume on UNIX. * The file system is not accessed.

source: * <File::Spec> – `($volume, $directories, $file) = File::Spec->splitpath($path)`. * <File::Basename> – `($name, $path, $suffix) = fileparse($fullname, @suffixlist)`. * <Path::Class::File> – `file('foo', 'bar.txt')->is_absolute`. * <Path::Extended::File> – `Path::Extended::File->new('path/to/file')->basename`. * <Parse::Path> – `Parse::Path->new(path => 'gophers[0].food.count', style => 'DZIL')->push("chunk")`. Работает с путями как с массивами (`push`, `pop`, `shift`, `splice`). Так же перегружает операторы сравнения. У него есть стили: `DZIL`, `File::Unix`, `File::Win32`, `PerlClass` и `PerlClassUTF8`.
ru_en: * <File::Spec> – `($volume, $directories, $file) = File::Spec->splitpath($path)`. * <File::Basename> – `($name, $path, $suffix) = fileparse($fullname, @suffixlist)`. * <Path::Class::File> – `file('foo', 'bar.txt')->is_absolute`. * <Path::Extended::File> – `Path::Extended::File->new('path/to/file')->basename`. * <Parse::Path> – `Parse::Path->new(path => 'gophers[0].food.count', style => 'DZIL')->push("chunk")`. Works with paths as with arrays (`push`, `pop`, `shift`, `splice`). It also overloads comparison operators. It has styles: `DZIL`, `File::Unix`, `File::Win32`, `PerlClass` and `PerlClassUTF8`.

source: Подключает `$pkg` (если он ещё не был подключён через `use` или `require`) и возвращает его. Без параметра использует `$_`.
ru_en: Connects `$pkg` (if it has not already been connected via `use` or `require`) and returns it. Without a parameter, uses `$_`.

source: Файл lib/A.pm:
ru_en: lib/A.pm file:

source: Файл lib/N.pm:
ru_en: lib/N.pm file:

source: Считывает файл в первый раз. Любая последующая попытка считать этот файл возвращает `undef`. Используется для вставки модулей js и css в результирующий файл. Без параметра использует `$_`.
ru_en: Reads the file for the first time. Any subsequent attempt to read this file returns `undef`. Used to insert js and css modules into the resulting file. Without a parameter, uses `$_`.

source: * `$file` может содержать массивы из двух элементов. Первый рассматривается как путь, а второй — как слой. Слой по умолчанию — `:utf8`. * Если `$file` не указан – использует `$_`.
ru_en: * `$file` can contain arrays of two elements. The first is treated as a path and the second as a layer. The default layer is `:utf8`. * If `$file` is not specified, use `$_`.

source: Переводит файловую маску в регулярное выражение. Без параметра использует `$_`.
ru_en: Converts a file mask to a regular expression. Without a parameter, uses `$_`.

source: * `**` - `[^/]*` * `*` - `.*` * `?` - `.` * `??` - `[^/]` * `{` - `(` * `}` - `)` * `,` - `|` * Остальные символы экранируются с помощью `quotemeta`.
ru_en: * `**` - `[^/]*` * `*` - `.*` * `?` - `.` * `??` - `[^/]` * `{` - `(` * `}` - `)` * `,` - `|` * Other characters are escaped using `quotemeta`.

source: Используется в фильтрах функции `find`.
ru_en: Used in filters of the `find` function.

source: **См. также:**
ru_en: **Cm. Also:**

source: Открывает файл в редакторе из .config на указанной строке. По умолчанию использует `vscodium %p:%l`.
ru_en: Opens the file in the editor from .config at the specified line. Defaults to `vscodium %p:%l`.

source: Файл .config.pm:
ru_en: .config.pm file:

source: Переводит пакет в путь ФС. Без параметра использует `$_`.
ru_en: Transfers the packet to the FS path. Without a parameter, uses `$_`.

source: Переводит путь из ФС в пакет. Без параметра использует `$_`.
ru_en: Translates the path from the FS to the package. Without a parameter, uses `$_`.
